org/concepts/inspo.org
#+setupfile:./hugo_setup.org
#+hugo_slug: inspirational-sites
#+title: inspirational websites
[[https://amorphous.itch.io/][strange narrative games, good mono font]]
[[https://scuttlebutt.nz][scuttlebutt : the decentralized, social web.
localized but distribued.]]

* setting up weechat as frontend for everything
[[https://cineshader.com/][cellular noise]]
[[https://www.olivevideoeditor.org/][free video edition]]
also look into editing with blender
tildegit :: git for the tildeverse!
[[https://dev.upvote.blog/][upvote.blog]], a

* blogging for free
[[https://bearblog.dev/][bear blog]]
[[https://pluma.cloud/][pluma free blog]]
[[https://write.as/][focused writing place]]
[[http://txti.es/][convenient, fast web pages]]
[[https://telegra.ph/why-am-i-here-05-29][express yourself quickly]]
[[https://txt.fyi/+/22b9f246/][raw expression]]
[[https://txt.fyi/+/6ce898cf/][the cask ]]
[[https://txt.fyi/+/57688c94]][real shit]]
[[/#/][another one of these]]
[[http://ix.io/][kinda fire. more minimal and more obscure]]
[[https://commentpara.de/][anon we comments on any site]]
[[https://rwtxt.com/public][reading and text editor]]
[[https://write.as/][focused writing.]]
[[https://gopher.tildeverse.org/tildeverse.org][tilde. in gopher.]]
[[https://dotdotdash.io/][collective.]]
[[https://online-go.com/][an excellent client for playing go]]

* Tools for Better Thinking
[[https://news.ycombinator.com/item?id=23339830][thread]]
The most underrated problem solving tool is to type out and explain your
thought process.
Start writing down questions to ask others; as you explain what you have
tried, you will begin to realize that there are more things left to try --
some of which being potential solutions.

Type your question into StackOverflow to submit; you'll be fearful of asking
the question.

Rank factors; always express factors as positive attributes. After generating
the table, the longest continuous line of check marks for each factor
determines the choice (though this can be gamed...)

State charts: easy to reason about state changes without the explosion of
state machines. These are hierarchical state machines, in a sense.

The Inversion Methods: The solution to many hard problems can be clarified by
re-expressing them in inverse form.

Crossline: structure your thoughts as you type and make cross-references.

[[https://fs.blog/mental-models/][mental models for making intelligent decisions]]

[[https://medium.com/disruptive-design/search?q=tools%20for%20systems%20thinkers][tools for systems thinkers]]
[[https://news.ycombinator.com/item?id=22747409][state machines for complex systmes]]
[[https://www.wiley.com/en-us/TRIZ+for+Engineers%3A+Enabling+Inventive+Problem+Solving-p-9780470741887][enabling inventive problem solving]]
[[https://en.m.wikipedia.org/wiki/TRIZ][analyzing and forecasting tool]]

[[https://untools.co/][tools for better thinking .]]


* today's js
https://lea.verou.me/2020/05/todays-javascript-from-an-outsiders-perspective/
article
THe modern web is painful. Interfacing with js and node results in conflitts
between es and js versions, node incompatibilities, differnet import syntax
in different circumstances, etc. it's painful. How do you import with node?
without node? <script> tag or not to script? Where did the node modules go?
This is a good rant of questions and things to feature on the wbesite

* record of a living being
https://cinemasojourns.com/2020/03/29/akira-kurosawas-record-of-a-living-being/
source
watch the film :: one of the first to directly address the fear of nuclear
holocaust and the implications of the atom bomb.  an introspective, cerebral
work regarding japan after the bomb and moving forward, away from fallout.
inspired by conversations with otuers regarding what may -- or may not be --
in store for us tomorrow, if tomorrow is in store at all.

* anxiety in product development
https://andreschweighofer.com/agile/anxiety-in-product-development/
anxiety can emerge easily from stress, resulting in anger, frustration and
other unhealthy forms of exerting such stress. this impacts other people,
organizations and processes as well. 
we have fear driven development : a concrete idea encouraging us to avoid
certain practices depending upon the specific approach

play to win, don't play not to lose; developing a unique selling proposition
means that you are no longer fighting with others, but rather striving to
come out ahead

awareness of such anxiety is the first step to take. with this awareness
comes conscious decision making, and with such decisions come wiser product
crafting and, in the end, better, more creative work

* bootstrappable builds
http://bootstrappable.org/
http://bootstrappable.org/projects.html good projects to work on
this is a general build philosophy addressing the chicken and egg problem --
to trust platforms, we must see how each part is produced from source, but we
do not have access to the source of compiled code when we run it against the
language they are compiling!
http://bootstrappable.org/ on trusting trust. ken thompson talk linked at the
bottom is great, as are the other articles. great compilers literature

* general ideas
** 50 ideas that changed my life
https://www.perell.com/blog/50-ideas-that-changed-my-life
inversion :: avoiding stupidity is easier and better than being brilliant
doublespeak :: saying the opposite of what one means
theory of constraints :: focus on the bottleneck, the weakest point of the
system, always.
preference falsification :: lying to conform to the most socially acceptable
opinion at the time
mimetic teory of desire: rather than having our own desires, we imitate the
desires of others and pursue their ideas
mimetic theory of conflict :: similar = fight

left off on 10!

* cool cs
https://github.com/browserdotsys/vecchio ray tracing in one weekend :: looks
fun to do
http://gokcehan.github.io/ has some idea what he is doing; wrote lf, which
 seems to be a better ranger
 
* idea
[[https://derivationmap.net/][deriation graph of all of math physics!]] 
